<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Carbon\Carbon;
use App\Models\Category;

class CategoriesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $node = Category::create([
            'name' => '',
            'children' => [
                [
                    'name' => '文学・評論',
                    'children' => [
                        [
                            'name' => '文芸作品',
                            'children' => [
                                ['name' => '日本文学'],
                                ['name' => '中国文学'],
                                ['name' => 'アジア文学'],
                                ['name' => '英文文学'],
                                ['name' => 'ドイツ文学'],
                                ['name' => 'フランス文学'],
                                ['name' => 'スペイン文学'],
                                ['name' => 'イタリア文学'],
                                ['name' => 'ロシア文学'],
                                ['name' => 'ギリシャ・ラテン文学'],
                                ['name' => 'その他の外国文学'],
                                ['name' => '評論・文学ガイド文学'],
                            ]
                        ],
                        ['name' => '歴史・時代小説'],
                        ['name' => '経済・社会小説'],
                        ['name' => 'ミステリー サスペンス ハードボイルド'],
                        ['name' => 'SF・ホラー・ファンタジー'],
                        ['name' => 'ロマンス'],
                        [
                            'name' => 'エッセー・随筆',
                            'children' => [
                                ['name' => '日本のエッセー・随筆'],
                                ['name' => '外国のエッセー・随筆'],
                                ['name' => '日記・書簡'],
                                ['name' => 'グルメ'],
                                ['name' => '住まい・インテリア'],
                                ['name' => '名言・箴言'],
                            ]
                        ],
                        [
                            'name' => '古典',
                            'children' => [
                                ['name' => '日本の古典'],
                                ['name' => '中国の古典'],
                                ['name' => 'その他'],
                            ],
                        ],
                        [
                            'name' => '詩歌',
                            'children' => [
                                ['name' => '詩論'],
                                ['name' => '詩集'],
                                ['name' => '外国詩'],
                                ['name' => '漢詩'],
                                ['name' => '和歌・俳諧'],
                                ['name' => '歌集'],
                                ['name' => '句集'],
                                ['name' => '季語・歳時記'],
                            ]
                        ],
                        [
                            'name' => '戯曲・シナリオ',
                            'children' => [
                                ['name' => '日本'],
                                ['name' => 'イギリス・アメリカ'],
                                ['name' => 'ドイツ'],
                                ['name' => 'フランス'],
                                ['name' => 'スペイン'],
                                ['name' => 'イタリア'],
                                ['name' => 'ロシア'],
                            ]
                        ],
                        [
                            'name' => '評論・文学研究',
                            'children' => [
                                ['name' => '文学理論'],
                                ['name' => '日本文学研究'],
                                ['name' => '外国文学研究'],
                                ['name' => '作家研究'],
                                ['name' => 'ミステリー論'],
                                ['name' => '児童文学評論'],
                                ['name' => 'コミック・アニメ研究'],
                                ['name' => '論文集・講演集・対談集'],
                                ['name' => '文学史'],
                                ['name' => '参考図書・書誌'],
                                ['name' => '雑誌・逐次刊行物'],
                            ]
                        ],
                        ['name' => '伝承・神話'],
                        [
                            'name' => '全書・選書',
                            'children' =>  [
                                ['name' => '日本文学'],
                                ['name' => '中国文学'],
                                ['name' => '英米文学'],
                                ['name' => 'ドイツ文学'],
                                ['name' => 'フランス文学'],
                                ['name' => 'ロシア文学'],
                                ['name' => 'その他の外国文学'],
                                ['name' => '個人全集'],
                            ]
                        ]
                    ]
                ],      
                [
                    'name' => 'コンピュータ・IT',
                    'children' => [
                        [
                            'name' => '入門書',
                            'children' => [
                                ['name' => 'アプリケーション入門書'],
                                ['name' => 'インターネット入門書'],
                                ['name' => 'SNS入門書'],
                                ['name' => 'クラウド入門書'],
                                ['name' => 'モバイル・タブレット入門書'],
                                ['name' => 'グラフィックス・DTP・DTM入門書'],
                                ['name' => 'ホームページ入門書'],
                                ['name' => 'プログラミング入門書'],
                                ['name' => 'パソコン入門書'],
                                ['name' => 'Windows入門書'],
                                ['name' => 'Macintosh入門書'],
                                ['name' => 'ネットワーク入門書'],
                                ['name' => 'データベース入門書'],
                                ['name' => '白書・用語辞典・参考書'],
                            ]
                        ],
                        [
                            'name' => 'コンピュータサイエンス',
                            'children' => [
                                ['name' => 'コンピュータサイエンス'],
                                ['name' => '情報学・情報科学'],
                                ['name' => '人工知能'],
                                ['name' => '暗号理論'],
                                ['name' => '計算機'],
                                ['name' => 'システム管理・監査'],
                                ['name' => 'セキュリティー管理'],
                            ]
                        ],
                        [
                            'name' => 'パソコン・周辺機器',
                            'children' => [
                                ['name' => 'パソコン入門書'],
                                ['name' => 'パソコン'],
                                ['name' => 'パソコン辞事典'],
                                ['name' => '自作パソコン'],
                                ['name' => '周辺機器'],                                         
                            ]
                        ],
                        [
                            'name' => 'OS',
                            'children' =>  [
                                ['name' => 'Windows'],
                                ['name' => 'MacOS'],
                                ['name' => 'Unix'],
                                ['name' => 'Linux'],
                            ]
                        ],
                        [
                            'name' => 'ネットワーク',
                            'children' => [
                                ['name' => 'ネットワーク'],
                                ['name' => 'ネットワーク入門書'],
                                ['name' => 'LAN'],
                                ['name' => 'サーバ'],
                                ['name' => 'プロトコル'],
                                ['name' => '著者'],
                            ]
                        ],
                        [
                            'name' => 'インターネット・eビジネス',
                            'children' =>  [
                                ['name' => 'インターネット入門書'],
                                ['name' => 'e-ビジネス'],
                                ['name' => '通信・メール'],
                                ['name' => 'ブラウザ'],
                                ['name' => 'SNS・ブログ'],
                                ['name' => 'オンライン・ソーシャルゲーム'],
                                ['name' => 'クラウド'],
                            ]
                        ],
                        [
                            'name' => 'プログラミング',
                            'children' => [
                                ['name' => 'プログラミング入門書'],
                                ['name' => 'ゲームプログラミング'],
                                ['name' => 'ソフトウェア開発・言語'],
                                ['name' => 'モバイルプログラミング'],
                                ['name' => '開発技法'],                                    
                            ]   
                        ],
                        [
                            'name' => 'アプリケーション',
                            'children' => [
                                ['name' => '文書作成ソフト'],
                                ['name' => '表計算ソフト'],
                                ['name' => 'プレゼンテーションソフト'],
                                ['name' => 'ブラウザ'],
                                ['name' => '通信・メール'],
                                ['name' => 'データベースソフト'],
                                ['name' => 'はがきソフト'],                                        
                            ]
                        ],
                        [
                            'name' => 'データベース',
                            'children' => [
                                ['name' => 'データベース処理'],
                                ['name' => 'データベースソフト'],
                            ]
                        ],
                        [
                            'name' => 'グラフィックス・DTP・音楽',
                            'children' => [
                                ['name' => '3D グラフィックス'],
                                ['name' => 'マルチメディア'],
                                ['name' => '電子書籍制作'],
                                ['name' => 'グラフィックス'],
                                ['name' => 'DTP'],
                                ['name' => '動画編集・DTV'],
                                ['name' => 'DTM'],
                                ['name' => 'CAD'],
                            ]
                        ],
                        [
                            'name' => 'モバイル・タブレット',
                            'children' =>
                                [
                                    ['name' => 'モバイル・タブレット'],
                                ]
                        ],
                        [
                            'name' => 'Web作成・開発',
                            'children' => [
                                ['name' => 'ホームページ入門書'],
                                ['name' => 'Web構築・管理'],
                                ['name' => 'Webプログラミング'],
                            ]
                        ],
                    ]
                ],
                [
                    'name' => 'コミック・ラノベ',
                    'children' =>[
                        [
                            'name' => 'コミック',
                            'children' => [
                                ['name' => '少年コミック'],
                                ['name' => '青年コミック'],
                                ['name' => '少女コミック'],
                                ['name' => '女性コミック'],
                                ['name' => '4コマまんが'],
                            ]
                        ],
                        [
                            'name' => 'ラノベ',
                            'children' => [
                                ['name' => '文庫'],
                                ['name' => '単行本'],
                            ],
                        ],
                    ],
                ],
                [
                    'name' => 'ビジネス・経済',

                    'children' => [
                        [
                            'name' => '経済学・経済事情',
                            'children' => [
                                ['name' => '経済学'],
                                ['name' => '経済思想・経済学説'],
                                ['name' => '経済史'],
                                ['name' => '財政学'],
                                ['name' => '各国経済事情'],
                            ]
                        ],
                        [
                            'name' => '産業研究',
                            'children' => [
                                ['name' => '農林水産'],
                                ['name' => '建設・住宅'],
                                ['name' => '食品'],
                                ['name' => '資源・エネルギー'],
                                ['name' => '製造・加工'],
                                ['name' => '鉄鋼・化学'],
                                ['name' => '自動車・機械'],
                                ['name' => '電気・電子'],
                                ['name' => '病院・医薬品'],
                                ['name' => 'サービス・小売'],
                                ['name' => '銀行・金融'],
                                ['name' => '不動産'],
                                ['name' => '交通'],
                                ['name' => '流通・物流'],
                                ['name' => '産業史'],
                                ['name' => 'その他'],
                            ]
                        ],
                        [
                            'name' => 'マーケティング・セールス',
                            'children' => [
                                ['name' => '一般'],
                                ['name' => '商業デザイン'],
                                ['name' => 'セールス・営業'],
                                ['name' => 'マーケティング・セールス　全般'],
                                ['name' => '商品開発'],
                                ['name' => '広告・宣伝'],
                            ]
                        ],
                        [
                            'name' => '経理・アカウンティング',
                            'children' => [
                                ['name' => '会計学'],
                                ['name' => '会計・会計学入門'],
                                ['name' => '財務会計'],
                                ['name' => '財務管理'],
                                ['name' => '財務諸表'],
                                ['name' => '税務会計'],
                                ['name' => '国際会計'],
                                ['name' => '各国会計論'],
                                ['name' => 'キャッシュフロー'],
                                ['name' => '簿記'],
                            ]
                        ],
                        ['name' => '金融・ファイナンス'],
                        ['name' => 'オペレーションズ'],
                        ['name' => 'マネジメント・人材管理'],
                        ['name' => '経営戦略'],
                        [
                            'name' => '経営学・キャリア・MBA',
                            'children' => [
                                ['name' => 'マーケティング・セールス'],
                                ['name' => '経理・アカウンティング'],
                                ['name' => '金融・ファイナンス'],
                                ['name' => 'オペレーションズ'],
                                ['name' => 'マネジメント・人材管理'],
                                ['name' => '統計学・数学'],
                                ['name' => '経営戦略'],
                                ['name' => 'ロジカル・シンキング'],
                                ['name' => 'ビジネス英語'],
                                ['name' => '資格・就職・MBA'],
                                ['name' => '起業'],
                            ]
                        ],
                        [
                            'name' => '実践経営・リーダーシップ',
                            'children' => [
                                ['name' => '経営学'],
                                ['name' => '経営理論'],
                                ['name' => '経営管理'],
                                ['name' => '経営診断'],
                                ['name' => '企業経営'],
                                ['name' => '企業動向'],
                                ['name' => 'CI・M&A'],
                                ['name' => '海外進出'],
                                ['name' => '売買契約'],
                                ['name' => '株主総会・取締役会・会社継承'],
                                ['name' => '環境とビジネス'],
                                ['name' => '歴史に学ぶビジネス'],
                                ['name' => 'リーダーシップ'],
                                ['name' => '参考図書・年鑑'],
                            ]
                        ],
                        [
                            'name' => 'IT',
                            'children' => [
                                ['name' => 'e-コマース'],
                                ['name' => 'ビジネスとIT'],
                                ['name' => '情報・コンピュータ産業'],
                                ['name' => '情報社会'],
                            ]
                        ],
                        ['name' => 'ビジネス・経済'],
                        [
                            'name' => '',
                            'children' => [
                                ['name' => '企業・経営'],
                                ['name' => '起業・開業'],
                                ['name' => '金融・銀行'],
                                ['name' => '世界経済'],
                                ['name' => '自伝・伝記'],
                                ['name' => 'その他'],
                            ]
                        ],
                        [
                            'name' => 'ビジネスの法律',
                            'children' => [
                                ['name' => 'ビジネス法入門'],
                                ['name' => '建築関連法規'],
                                ['name' => '薬事法'],
                                ['name' => '不動産'],
                                ['name' => '会社法'],
                                ['name' => '債権・物権法'],
                                ['name' => '労働法'],
                                ['name' => '商法'],
                                ['name' => '手形・小切手法'],
                                ['name' => '株主・監査役'],
                                ['name' => '独占禁止法'],
                                ['name' => '登記法'],
                                ['name' => '税法'],
                                ['name' => '製造物責任法'],
                            ]
                        ],
                        [
                            'name' => 'ビジネス実用',
                            'children' => [
                                ['name' => 'ビジネス英語'],
                                ['name' => 'ビジネス交渉・心理学'],
                                ['name' => 'ビジネスマナー'],
                                ['name' => 'ビジネスライフ'],
                                ['name' => 'ビジネス企画'],
                                ['name' => 'ビジネス文書'],
                                ['name' => 'プレゼンテーション'],
                                ['name' => '仕事術・整理法'],
                                ['name' => '環境とビジネス'],
                                ['name' => 'リーダーシップ'],
                                ['name' => 'Word・Excel・PowerPoint'],
                                ['name' => 'ビジネスコミックス'],
                            ]
                        ],
                        [
                            'name' => '参考図書・白書',
                            'children' => [
                                ['name' => '一般'],
                                ['name' => '産業研究'],
                                ['name' => '農林水産'],
                                ['name' => '投資・金融'],
                                ['name' => '経営'],
                                ['name' => '総務・人事・労務管理'],
                                ['name' => '統計法・人口統計・資源統計'],
                            ]
                        ],
                        
                        
                        
                        
                        
                    ],
                ],
            ],
        ]);



    }
}